In [1]:
import os

In [2]:
os.getcwd()

'C:\\Users\\Sudarshan\\Documents\\Naresh IT\\EDA'

In [9]:
a='abcm sjbcjsahcuaugdad'
a[-1::-1]
a[-1]

'd'

In [13]:
a='abcm sjbcjsahcuaugdad'
for i in range(1,len(a)+1):
    a[-i]
    print(a[-i],end='')

dadguauchasjcbjs mcba

# l1=[]
# l2=[]



    
}

   Names   Age    City
0    Sud   NaN     Hyd
1   Shiv  20.0    Pune
2    NaN  24.0  Mumbai
3  Shyam  25.0     NaN

In [25]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

   Names   Age    City
0    Sud   NaN     Hyd
1   Shiv  20.0    Pune
2    NaN  24.0  Mumbai
3  Shyam  25.0     NaN

In [27]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Names   3 non-null      object
 1   Age     3 non-null      float64
 2   City    3 non-null      object
dtypes: float64(1), object(2)
memory usage: 228.0+ bytes

In [38]:
d1= {'Names':['Sud','Shiv',np.nan,'Shyam'],
     'Age':[np.nan,20,24,25],
     'City':['Hyd','Pune','Mumbai',np.nan]}
df=pd.DataFrame(d1)
df

   Names   Age    City
0    Sud   NaN     Hyd
1   Shiv  20.0    Pune
2    NaN  24.0  Mumbai
3  Shyam  25.0     NaN

In [36]:
age_mean=df['Age'].mean()
df['Age'].fillna(age_mean)

0    23.0
1    20.0
2    24.0
3    25.0
Name: Age, dtype: float64

In [40]:
age_median=df['Age'].median()
df['Age'].fillna(age_median)

0    24.0
1    20.0
2    24.0
3    25.0
Name: Age, dtype: float64

In [43]:
mode_age=df['Age'].mode()
df['Age'].fillna(mode_age)

0    20.0
1    20.0
2    24.0
3    25.0
Name: Age, dtype: float64

**Method - 5**  
**KNN imputer**

In [51]:
from sklearn.impute import KNNImputer
KI=KNNImputer
df['Age'].fillna(KI)

0    <class 'sklearn.impute._knn.KNNImputer'>
1                                        20.0
2                                        24.0
3                                        25.0
Name: Age, dtype: object